Autodesk.Revit.DB.TagMode
An enumerated type listing tag mode that are supported for IndependentTags.

Autodesk.Revit.DB.TagMode.TM_ADDBY_MATERIAL
The Tag you add by Material.

Autodesk.Revit.DB.TagMode.TM_ADDBY_MULTICATEGORY
The Tag you add by Multi-Category.

Autodesk.Revit.DB.TagMode.TM_ADDBY_CATEGORY
The Tag you add by Category.